// Написать программу, которая из имеющегося массива строк формирует массив из строк,
// длина которых меньше либо равна 3 символа. Первоначальным массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.

Console.WriteLine("Hello, World!");
